app/views/subjects/show.html.erb


<p>Courses: <% @subject.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."subject_id" = ?  [[nil, 1]]