app/views/courses/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = ?  [[nil, 1]]
---

<p>Posts: <% @course.posts.each do |post| %></p>