app/controllers/courses_controller.rb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = 'Math' LIMIT 1
INSERT INTO "courses" ("created_at", "description", "number", "subject_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 16 Nov 2016 23:20:17 UTC +00:00], ["description", "Linear Algebra"], ["number", "54"], ["subject_id", 1], ["updated_at", Wed, 16 Nov 2016 23:20:17 UTC +00:00]]
---
    def create
        subject = Subject.find_by(name: params[:course][:subject])
        if !subject
          redirect_to root_path, :flash => { :error => "Subject does not exist" }
        end
        course = Course.new(
          :number => params[:course][:number],
          :subject_id => subject.id,
          :description => params[:course][:description])
        if course.valid?
          course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
    def delete
      course = Course.find(params[:id])
      course.destroy