app/controllers/subjects_controller.rb

    def create
      #if @subject.valid?
        @subject = Subject.new(:name => params[:subject][:name])
        @subject.save
---
INSERT INTO "subjects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 16 Nov 2016 22:17:23 UTC +00:00], ["name", "Math"], ["updated_at", Wed, 16 Nov 2016 22:17:23 UTC +00:00]]